Ran Plan for project: `clb` dir: `clb` workspace: `default`

<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa3bc377fa1be9cb114d14b27fed19abd2_NpVH8YZIP6wD8AQyEr21d34l4eXUzVMUwZjX9URAsosy4-2nc9wgUdnkLvYWUAV-Xucu3PGqxvnMIQPJ3_OlW8bndD5bro9TD0fuNbMMw_dmOgUdU2z1TuH_VKkWIJmXNuz9O2jOBGXtQpWwJy5Kf2ArtgCvuVqZapT27xTjvBR1CQiZKcBc34Qvnu2LwOWaP-dVywXMGjnkkd5iLPpFQYICWX_r38xqGPS9TFTVBWm-UKuckPjjJ1yuUOuzwfC_-B9NbKfmU6VpKcLcoRqQrfRvyisrPe5bPHQVQjwA3BN7tdS_VK_4EGpeceK0N0-E8Yr_e0QFeN2cKiN_zSNT7nyu9cO0u6F0gFWoZaokqvx99CNmzztMMnx8drLUTJ9b2qbOIWx8GQP7plKAqnpy6xWrcJwHj1Qi1snidm2QsQ
TmpSecretId=AKIDKtimsilGmttcDHv52bpjxfD7OkEbKOSS8HjfPsvjWhrHyEw6CDFYTJLcFkGfncM7
TmpSecretKey=lWjabs+a2hg2eSgDpshNfOsVq7toITltbRoLEFf3+tY=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDKtimsilGmttcDHv52bpjxfD7OkEbKOSS8HjfPsvjWhrHyEw6CDFYTJLcFkGfncM7
TENCENTCLOUD_SECRET_KEY=lWjabs+a2hg2eSgDpshNfOsVq7toITltbRoLEFf3+tY=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa3bc377fa1be9cb114d14b27fed19abd2_NpVH8YZIP6wD8AQyEr21d34l4eXUzVMUwZjX9URAsosy4-2nc9wgUdnkLvYWUAV-Xucu3PGqxvnMIQPJ3_OlW8bndD5bro9TD0fuNbMMw_dmOgUdU2z1TuH_VKkWIJmXNuz9O2jOBGXtQpWwJy5Kf2ArtgCvuVqZapT27xTjvBR1CQiZKcBc34Qvnu2LwOWaP-dVywXMGjnkkd5iLPpFQYICWX_r38xqGPS9TFTVBWm-UKuckPjjJ1yuUOuzwfC_-B9NbKfmU6VpKcLcoRqQrfRvyisrPe5bPHQVQjwA3BN7tdS_VK_4EGpeceK0N0-E8Yr_e0QFeN2cKiN_zSNT7nyu9cO0u6F0gFWoZaokqvx99CNmzztMMnx8drLUTJ9b2qbOIWx8GQP7plKAqnpy6xWrcJwHj1Qi1snidm2QsQ
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Using previously-installed tencentcloudstack/tencentcloud v1.81.111

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa89f6cb58790571ed84478ca02a38183b_NpVH8YZIP6wD8AQyEr21c-4uwrm1Ibq__LraTt1zsxyBivUSeXAFFk4Cei1ksxmz8tsZY1q9wvrGvqcPXOrS-ftP9mnautqzm8dG-k74ZpK8T3QINFPzQSgvvKMbbgcRFFZDl8501t3iiRDe3mC1ZkTXn1nK2tQHjW94CmjdwJthDEH96LRhCBr0Dgm7S5kn9n9jWCswRtsRovpds-yNrr89nM1ZjvDBrpEE_ZrmFKJnyQWoZ2XAQ1KBa-Gs2fsc16BI30_YJgq30uuGymxUUh4XScnwg6UYs6EG2hi8Tg1HwfEnqWCiwELTRhBCknsaA8jK4auCHv6ifHp_chCmLyR4sRCuQE-5qShVh9qTfWpAFJikOpUdpA4Z1LYnxGP3HUkByDRzWwnolip9pd33hi_fOiGspCFjNtZ99RiF5Q
TmpSecretId=AKIDWi4t9gDGzG5xoH-2VVMNtJHkvp8-alhBW4LulJKwhzODJRLT5jigb5khZT1ckrRA
TmpSecretKey=enWjhpkX6Lg2oZXQXgCW/zZ72SneUC1casTfiKo3LKA=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDWi4t9gDGzG5xoH-2VVMNtJHkvp8-alhBW4LulJKwhzODJRLT5jigb5khZT1ckrRA
TENCENTCLOUD_SECRET_KEY=enWjhpkX6Lg2oZXQXgCW/zZ72SneUC1casTfiKo3LKA=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa89f6cb58790571ed84478ca02a38183b_NpVH8YZIP6wD8AQyEr21c-4uwrm1Ibq__LraTt1zsxyBivUSeXAFFk4Cei1ksxmz8tsZY1q9wvrGvqcPXOrS-ftP9mnautqzm8dG-k74ZpK8T3QINFPzQSgvvKMbbgcRFFZDl8501t3iiRDe3mC1ZkTXn1nK2tQHjW94CmjdwJthDEH96LRhCBr0Dgm7S5kn9n9jWCswRtsRovpds-yNrr89nM1ZjvDBrpEE_ZrmFKJnyQWoZ2XAQ1KBa-Gs2fsc16BI30_YJgq30uuGymxUUh4XScnwg6UYs6EG2hi8Tg1HwfEnqWCiwELTRhBCknsaA8jK4auCHv6ifHp_chCmLyR4sRCuQE-5qShVh9qTfWpAFJikOpUdpA4Z1LYnxGP3HUkByDRzWwnolip9pd33hi_fOiGspCFjNtZ99RiF5Q

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```